BusinessProcesses/БП_ПеремещениеТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<BusinessProcess>
		<Properties>
			<Name>БП_ПеремещениеТовара</Name>
			<Task>Task.БП_ЗадачиИсполнителей</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеТоваров</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийДляПеремещенияТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладСОстаткомТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладВыдачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскийБизнесПроцес</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.БП_ОбработкаСтрокиЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДоствкиВнутренний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыВнутреннегоЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыВнутреннегоЗаказа</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСклад</Name>
					<Comment>(общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПодразделение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПеремещениеТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварыПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыПродукцияПоОрдерам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БланкиСтрогогоУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/БП_ТипыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>БП_ТипыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроверитьОстаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьРасходныйОрдер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьТовар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучитьТовар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьПриходныйОрдер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗаказПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобратьЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаЖдетОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучитьДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПоИнвентаризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВернутьДеньгиКлиентуНаКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВернутьДеньгиКлиентуНаРасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверитьДокументыПоВозврату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНаПроизвольныйСчетИлиКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПакетДокументовПоПолучениюДСВКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПакетДокументовПоПеремещениюСоСчетаНаСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПривязатьВходящуюПлатежкуКВнутреннемуПеремещениюДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучитьДеньгиВКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьВнутреннееПеремещениеДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьФормированиеДокументовПоИнвентаризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроставитьСпособыДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверитьОстатокИПодготовитьКОтправкеТовар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапоминаниеОСобытии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдатьСредстваИзКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодерацияНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдатьТовар</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРезервированиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРезервированиеТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСкладам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
					<Comment>(Упр)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладамИЗаказам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/БП_ПеремещениеТовара/Ext/ObjectModule.bsl
Процедура СоздатьВнутреннийЗаказИПеремещениеОбработка(ТочкаМаршрутаБизнесПроцесса)
	Попытка	
		ЗаписьЖурналаРегистрации("БП_СозданиеДокументов.ВнутренийЗаказ.Начало", 
		УровеньЖурналаРегистрации.Информация, , ,
		"Начало");
		
		Если ЗначениеЗаполнено(ХарактеристикаНоменклатуры) Тогда 	
			//Если ДелатьИзНеРазборногоКомплекта(ХарактеристикаНоменклатуры) Тогда 
			//	
			//	ХарактеристикаКомплекта = ПолучитьНоменклатуруХарактеристикуКомплекта(ХарактеристикаНоменклатуры);
			//	Комплект = зетаБУУправлениеЗапаснымиЧастями.ПолучитьКомплект(ХарактеристикаНОменклатуры);
			//	
			//	Если ЗначениеЗаполнено(ХарактеристикаКомплекта) Тогда 
			//		
			//		Разукомплектация = Документы.зетаБУРазукомплектация.СоздатьДокумент();
			//		Разукомплектация.Номенклатура = Комплект.Владелец;
			//		Разукомплектация.ХарактеристикаНоменклатуры = Комплект;
			//		Разукомплектация.Склад		  = ПолучитьСкладОсновнойДелали(Номенклатура,ХарактеристикаНоменклатуры);
			//		Разукомплектация.Организация  = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация");
			//		
			//		ТаблицаКомплекта = зетаБУУправлениеЗапаснымиЧастями.ПолучитьТаблицуСоставаКомплектаСКомплектом(ХарактеристикаНоменклатуры, ТекущаяДата(), Ложь);
			//		
			//		Разукомплектация.СоставКомплекта.Загрузить(ТаблицаКомплекта);
			//		
			//		Для каждого СтрокаСоставаКомплекта из Разукомплектация.СоставКомплекта цикл
			//			Если СтрокаСоставаКомплекта.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры Тогда 
			//				СтрокаСоставаКомплекта.Извлечь = Истина;
			//			Иначе
			//				СтрокаСоставаКомплекта.Извлечь = Ложь;
			//			КонецЕсли;
			//		КонецЦикла;
			//		//Разукомплектация.СоставКомплекта.Загрузить(ТаблицаСоставаКомплекта);
			//		
			//		Форма = Разукомплектация.ПолучитьФорму("ФормаДокумента");
			//		Форма.Открыть();
			//		Форма.ЗаписатьВФорме(РежимЗаписиДокумента.Проведение);
			//		Форма.Закрыть();
			//	КонецЕсли;
			//КонецЕсли;
		КонецЕсли;
					
		//ДокументСменыКомплекта.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		Документ = Документы.ВнутреннийЗаказ.СоздатьДокумент();
		Документ.ВидЗаказа     = Перечисления.ВидыВнутреннегоЗаказа.НаСклад;
		Документ.Дата 	       = ТекущаяДата();
		Документ.Заказчик      = СкладВыдачи;
		Документ.Организация   = ЗаказПокупателя.Организация;
		Документ.Комментарий   = "Созданно Бизнес-процессом";
		Документ.Подразделение = СкладВыдачи.Подразделение;
		Документ.ДокументОснование = ЗаказПокупателя; 
		
		Товар = Документ.Товары.Добавить();
		Товар.Номенклатура 	   			 = Номенклатура;
		Товар.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Товар.ЕдиницаИзмерения 			 = Номенклатура.ЕдиницаХраненияОстатков;
		Товар.Коэффициент 	   			 = 1;
		Товар.Количество 	   			 = Количество;
		Товар.Размещение                 = СкладСОстаткомТовара;
		
		Документ.Записать(РежимЗаписиДокумента.Запись);
		ЗаписьЖурналаРегистрации("БП_СозданиеДокументов.ВнутренийЗаказ.Запись", 
		УровеньЖурналаРегистрации.Информация, , ,
		"Запись документа");
		
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗаписьЖурналаРегистрации("БП_СозданиеДокументов.ВнутренийЗаказ.Запись", 
		УровеньЖурналаРегистрации.Информация, , ,
		"Запись документа");
		
		ЗаказПокупателя = ЗаказПокупателя;
		ЗаказПокупателяоб =  ЗаказПокупателя.ПолучитьОбъект();
		
		ОтборСтроки = новый Структура;
		ОтборСтроки.Вставить("Номенклатура",Номенклатура);
		ОтборСтроки.Вставить("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
		ОтборСтроки.Вставить("Количество",Количество);
		ОтборСтроки.Вставить("НомерСтроки",НомерСтроки);	
		
		СтрокиЗаказа = ЗаказПокупателяоб.Товары.НайтиСтроки(ОтборСтроки);
		Если СтрокиЗаказа.Количество()=1 Тогда 
			СтрокаЗаказа = СтрокиЗаказа[0];
			СтрокаЗаказа.размещение = Документ.Ссылка;
		КонецЕсли;
		
		ЗаказПокупателяоб.Записать(РежимЗаписиДокумента.Проведение);
		
		ДокументПеремещения = Документы.ПеремещениеТоваров.СоздатьДокумент();
		ДокументПеремещения.ВидОперации      = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукцияПоОрдерам;
		ДокументПеремещения.Дата 	         = ТекущаяДата();
		//ДокументПеремещения.ВнутреннийЗаказ  = Документ.Ссылка;
		ДокументПеремещения.Организация      = ЗаказПокупателя.Организация;
		ДокументПеремещения.Комментарий      = "Созданно Бизнес-процессом";
		////ДокументПеремещения.Подразделение    = СкладВыдачи.Подразделение;
		ДокументПеремещения.СкладОтправитель = СкладСОстаткомТовара;
		ДокументПеремещения.СкладПолучатель  = СкладВыдачи;
		ДокументПеремещения.ОтражатьВУправленческомУчете = Истина;
		////ДокументПеремещения.ТипПеремещения   = Перечисления.ТипыПеремещенияТовара.ПодКлиента;
		////ДокументПеремещения.ЗаказПокупателя =  ЗаказПокупателя;
		
		
		Товар = ДокументПеремещения.Товары.Добавить();
		Товар.Номенклатура 	   			 = Номенклатура;
		Товар.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Товар.ЕдиницаИзмерения 			 = Номенклатура.ЕдиницаХраненияОстатков;
		Товар.Коэффициент 	   			 = 1;
		Товар.Количество 	   			 = Количество;
		Товар.ДокументРезерва            = Документ.Ссылка;
		Товар.Качество                   = Справочники.Качество.Новый;
		Товар.ВнутреннийЗаказ			 = Документ.Ссылка;
		
		ДокументПеремещения.Записать(РежимЗаписиДокумента.Запись);
		//Форма = ДокументПеремещения.ПолучитьФорму("ФормаДокумента");
		//форма.Открыть();
		//Форма.записатьВФорме();
		//Форма.Закрыть();
		ДокументПеремещения.Записать(РежимЗаписиДокумента.Проведение);
		
		ВнутреннийЗаказ    = Документ.Ссылка;
		ПеремещениеТоваров = ДокументПеремещения.Ссылка;
		ЭтотОбъект.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("БП_СозданиеДокументов.ВнутренийЗаказ.Исключение", 
		УровеньЖурналаРегистрации.Информация, , ,
		"исключение" + ОписаниеОшибки());
		
		
	КонецПопытки;
	
	ЭтотОбъект.Записать();
	
КонецПроцедуры


Процедура ОформитьРасходныйОрдерПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.Номенклатура  		      = Номенклатура;
		Задача.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Задача.СкладВыдачи 				  = СкладВыдачи;
		Задача.ПеремещениеТоваров		  = ПеремещениеТоваров;
		Задача.ВнутреннийЗаказ            = ВнутреннийЗаказ;
		Задача.подразделение		      = ПеремещениеТоваров.СкладОтправитель.Подразделение;
		Задача.Количество                 = Количество;
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.СоздатьРасходныйОрдер;
		Задача.ЗаказПокупателя			  = ЗаказПокупателя;
	КонецЦикла;
КонецПроцедуры

Процедура ОформитьПриходныйОрдерПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.Номенклатура  		      = Номенклатура;
		Задача.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Задача.СкладВыдачи 				  = СкладВыдачи;
		Задача.ПеремещениеТоваров		  = ПеремещениеТоваров;
		Задача.ВнутреннийЗаказ            = ВнутреннийЗаказ;
		Задача.подразделение		      = ПеремещениеТоваров.СкладПолучатель.Подразделение;
		Задача.Количество                 = Количество;
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.СоздатьПриходныйОрдер;
		Задача.ЗаказПокупателя			  = ЗаказПокупателя;
	КонецЦикла;

КонецПроцедуры


Процедура ОтправитьТоварВДругоеПодразделениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.Номенклатура  		      = Номенклатура;
		Задача.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Задача.СкладВыдачи 				  = СкладВыдачи;
		Задача.ПеремещениеТоваров		  = ПеремещениеТоваров;
		Задача.ВнутреннийЗаказ            = ВнутреннийЗаказ;
		Задача.подразделение		      = ПеремещениеТоваров.СкладОтправитель.Подразделение;
		Задача.Количество                 = Количество;
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.ОтправитьТовар;
		Задача.ЗаказПокупателя			  = ЗаказПокупателя;
		Задача.Комментарий				  = КомментарийДляПеремещенияТовара;
	КонецЦикла;

КонецПроцедуры

Процедура ПолучитьТоварПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.Номенклатура  		      = Номенклатура;
		Задача.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Задача.СкладВыдачи 				  = СкладВыдачи;
		Задача.ПеремещениеТоваров		  = ПеремещениеТоваров;
		Задача.ВнутреннийЗаказ            = ВнутреннийЗаказ;
		Задача.подразделение		      = ПеремещениеТоваров.СкладПолучатель.Подразделение;
		Задача.Количество                 = Количество;
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.ПолучитьТовар;
		Задача.ЗаказПокупателя			  = ЗаказПокупателя;
	КонецЦикла;

КонецПроцедуры

Процедура ОтправитьТоварВДругоеПодразделениеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
		//АдресДоставки 								= Задача.АдресВнутреннейДоставки.АдресДоставки;
		//ДокументДоставки 							= Документы.УД_Доставка.СоздатьДокумент();
		//ДокументДоставки.Дата 						= ТекущаяДата();
		//ДокументДоставки.ПаспортныеДанныеПолучателя = АдресДоставки.ПаспортныеДанныеПолучателя;
		//ДокументДоставки.АдресДоставки 			    = АдресДоставки.АдресДоставки;
		//ДокументДоставки.Получатель    				= АдресДоставки.Получатель;
		//ДокументДоставки.Телефон       				= АдресДоставки.Телефон;
		//ДокументДоставки.ИНН   		   				= АдресДоставки.ИНН;
		//ДокументДоставки.ТипПеревозки  				= АдресДоставки.ТипПеревозки;
		//ДокументДоставки.ТранспортнаяКомпания 		= АдресДоставки.ТранспортнаяКомпания;
		//ДокументДоставки.ОплатаДоставки       		= АдресДоставки.ОплатаДоставки;

		//ДокументДоставки.ДокументОснование = ПеремещениеТоваров;
		//
		//БизнесПроцессы.ДокументДоствкиВнутренний = ДокументДоставки.Ссылка;
		Попытка
			////Если не ЗначениеЗаполнено(ЭтотОбъект.ДокументДоствкиВнутренний) Тогда 
			////	АдресДоставки 								= Задача.АдресВнутреннейДоставки;
			////	ДокументДоставки 							= Документы.УД_Доставка.СоздатьДокумент();
			////	ДокументДоставки.Дата 						= ТекущаяДата();
			////	ДокументДоставки.ПаспортныеДанныеПолучателя = АдресДоставки.ПаспортныеДанныеПолучателя;
			////	ДокументДоставки.АдресДоставки 			    = АдресДоставки.АдресДоставки;
			////	ДокументДоставки.Получатель    				= АдресДоставки.Получатель;
			////	ДокументДоставки.Телефон       				= АдресДоставки.Телефон;
			////	ДокументДоставки.ИНН   		   				= АдресДоставки.ИНН;
			////	ДокументДоставки.ТипПеревозки  				= АдресДоставки.ТипПеревозки;
			////	ДокументДоставки.ТранспортнаяКомпания 		= АдресДоставки.ТранспортнаяКомпания;
			////	ДокументДоставки.ОплатаДоставки       		= АдресДоставки.ОплатаДоставки;
			////	
			////	ДокументДоставки.ДокументОснование = ПеремещениеТоваров;
			////	ДокументДоставки.Записать(РежимЗаписиДокумента.Проведение);
			////	
			////	ЭтотОбъект.ДокументДоствкиВнутренний = ДокументДоставки.Ссылка;
			////КонецЕсли; 	
			ЭтотОбъект.НомерТТН     = Задача.НомерТТН;
			ЭтотОбъект.ДатаОтправки = Задача.ДатаОтправки;
			////ЭтотОбъект.ТК           = Задача.АдресВнутреннейДоставки.ТранспортнаяКомпания;
			ЭтотОбъект.Записать();
		Исключение
			Сообщить("Произошла ошибка, обратитель к Администратору скопировав текст ошибки целиком " + ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
КонецПроцедуры

Процедура СоздатьДокументРезервированиеТовараОбработка(ТочкаМаршрутаБизнесПроцесса)
	Попытка
		Если ТипЗнч(РодительскийБизнесПроцес) = Тип("БизнесПроцессСсылка.БП_ОбработкаСтрокиЗаказа") 
			и ЗначениеЗаполнено(РодительскийБизнесПроцес) 
			и не РодительскийБизнесПроцес.Завершен Тогда 
			Документ = Документы.РезервированиеТоваров.СоздатьДокумент();
			Документ.ВидОперации = Перечисления.ВидыОперацийРезервированиеТоваров.ПоСкладамИЗаказам;
			Документ.Дата  = ТекущаяДата()+1;
			Документ.Заказ = ЗаказПокупателя;
			Строка = Документ.Товары.Добавить();
			Строка.ЕдиницаИзмерения = Номенклатура.ЕдиницаХраненияОстатков;
			Строка.Количество = Количество;
			Строка.Коэффициент = 1;
			Строка.Номенклатура = Номенклатура;
			Строка.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
			Строка.ИсходноеРазмещение = ПолучитьРезервТовара(Номенклатура,ХарактеристикаНоменклатуры,ЗаказПокупателя);
			Строка.НовоеРазмещение = СкладВыдачи;
			Документ.Комментарий = "Созанно бизнесс процессов " + Номер;
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция ПолучитьРезервТовара(Номенклатура,ХарактеристикаНоменклатуры,ЗаказПокупателя)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыВРезервеНаСкладахОстатки.Склад
	               |ИЗ
	               |	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеНаСкладахОстатки
	               |ГДЕ
	               |	ТоварыВРезервеНаСкладахОстатки.Номенклатура = &Номенклатура
	               |	И ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	               |	И ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток > 0
	               |	И ТоварыВРезервеНаСкладахОстатки.ДокументРезерва = &ДокументРезерва" ;
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("ДокументРезерва",ЗаказПокупателя);

	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 		
		Возврат РезультатЗапроса[0].Склад;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	Сообщить(ВедущаяЗадача);
КонецПроцедуры

Функция ПолучитьСкладОсновнойДелали(Номенклатура,Характеристика)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Склад
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |			,
	               |			Номенклатура = &Номенлкатура
	               |				И ХарактеристикаНоменклатуры = &Характеристика) КАК ТоварыНаСкладахОстатки";
	Запрос.УстановитьПараметр("Номенлкатура",Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].Склад; 	
	КонецЕсли;
КонецФункции


Функция ПолучитьНоменклатуруХарактеристикуКомплекта(Характеристика)
	
	////Запрос = новый запрос;
	////Запрос.Текст ="ВЫБРАТЬ
	////              |	ЗначенияСвойствОбъектов.Значение
	////              |ИЗ
	////              |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	////              |ГДЕ
	////              |	ЗначенияСвойствОбъектов.Объект = &Объект
	////              |	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	////Запрос.УстановитьПараметр("Объект",Характеристика);
	////Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("6.Номер комплекта"));
	////
	////РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	////
	////Если РезультатЗапроса.Количество() Тогда 
	////		НомерКомплекта = РезультатЗапроса[0].Значение;
	////		
	////		Запрос = новый запрос;
	////		Запрос.Текст = "ВЫБРАТЬ
	////		               |	Комплект.Объект
	////		               |ИЗ
	////		               |	(ВЫБРАТЬ
	////		               |		ЗначенияСвойствОбъектов.Объект КАК Объект
	////		               |	ИЗ
	////		               |		РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	////		               |	ГДЕ
	////		               |		ЗначенияСвойствОбъектов.Свойство = &СвойствоНомер
	////		               |		И ЗначенияСвойствОбъектов.Значение = &ЗначениеНомер) КАК Комплект
	////		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВидКомплектации
	////		               |		ПО Комплект.Объект = ВидКомплектации.Объект
	////		               |ГДЕ
	////		               |	ВидКомплектации.Свойство = &СвойствоВидКомплектации
	////		               |	И ВидКомплектации.Значение = ЗНАЧЕНИЕ(Перечисление.зетаБУВидыКомплектации.ПустаяСсылка)";
	////		Запрос.УстановитьПараметр("СвойствоВидКомплектации",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("4.Вид комплектации"));
	////		Запрос.УстановитьПараметр("СвойствоНомер",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("6.Номер комплекта"));
	////		Запрос.УстановитьПараметр("ПустоеСвойстоВидКомплектации",Перечисления.зетаБУВидыКомплектации.ПустаяСсылка());
	////		Запрос.УстановитьПараметр("ЗначениеНомер",НомерКомплекта);

	////		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	////		
	////		Если РезультатЗапроса.Количество() Тогда 
	////			Возврат РезультатЗапроса[0].Объект;
	////		Иначе
	////			Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	////		КонецЕсли;
	////	Иначе
				Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	////КонецЕсли;
	
	
	
КонецФункции

Функция ДелатьИзНеРазборногоКомплекта(ХарактеристикаНоменклатуры)

	ВозвращаемоеЗначение = Ложь;
	
	
	////Если ЗначениеЗаполнено(ХарактеристикаНоменклатуры) Тогда 
	////	
	////	Запрос = новый запрос;
	////	Запрос.Текст = "ВЫБРАТЬ
	////	|	ЗначенияСвойствОбъектов.Значение
	////	|ИЗ
	////	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	////	|ГДЕ
	////	|	ЗначенияСвойствОбъектов.Объект = &Объект
	////	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	////	Запрос.УстановитьПараметр("Объект",ХарактеристикаНоменклатуры);
	////	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("3.Вид комплекта"));
	////	
	////	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	////	
	////	Если РезультатЗапроса.Количество() Тогда 
	////		Если РезультатЗапроса[0].Значение = Перечисления.зетаБУВидыКомплектов.НеразборныйКомплект Тогда
	////			
	////			ЗапросПоКомплектации = новый запрос;
	////			ЗапросПоКомплектации.Текст = "ВЫБРАТЬ
	////			|	ЗначенияСвойствОбъектов.Значение
	////			|ИЗ
	////			|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	////			|ГДЕ
	////			|	ЗначенияСвойствОбъектов.Объект = &Объект
	////			|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	////			ЗапросПоКомплектации.УстановитьПараметр("Объект",ХарактеристикаНоменклатуры);
	////			ЗапросПоКомплектации.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("4.Вид комплектации"));
	////			
	////			РезультатЗапросаПоКомплектации = ЗапросПоКомплектации.Выполнить().Выгрузить();
	////			
	////			Если РезультатЗапросаПоКомплектации.Количество() Тогда 
	////				Если РезультатЗапросаПоКомплектации[0].Значение = Перечисления.зетаБУВидыКомплектации.НеосновнаяЧастьКомплекта
	////					или РезультатЗапросаПоКомплектации[0].Значение = Перечисления.зетаБУВидыКомплектации.ОсновнаяЧастьКомплекта Тогда  
	////					ВозвращаемоеЗначение = Истина;
	////				Иначе
	////					ВозвращаемоеЗначение = Ложь;
	////				КонецЕсли;	
	////			Иначе
	////				ВозвращаемоеЗначение = Ложь;
	////			КонецЕсли;
	////			
	////		Иначе
	////			ВозвращаемоеЗначение = Ложь;
	////		КонецЕсли;
	////	КонецЕсли;
	////КонецЕсли;
	Возврат ВозвращаемоеЗначение;
	
КонецФункции
